tests/results/siege_baseline-20260713-154205.log
Word counts for test articles:
    1497 data/2OJTYW7XNVHJJN7SPNP2IUFPA4.txt
     225 data/6KQF2OZTMFBCRNG6FPUQBOZ76Y.txt
     271 data/77FNWCDIJNBENOQVXPPWZ7O6PU.txt
    1107 data/7OHAODFOVZF7BBPFK2CQGGNW4I.txt
     281 data/BHQYE4ALXZEKTD674MBIIKEQ3Y.txt
    3381 total

** SIEGE 4.1.7
** Preparing 1 concurrent users for battle.
The server is now under siege...

Transactions:		        1    hits
Availability:		      100.00 %
Elapsed time:		       27.56 secs
Data transferred:	        1.47 MB
Response time:		    27560.00 ms
Transaction rate:	        0.04 trans/sec
Throughput:		        0.05 MB/sec
Concurrency:		        1.00
Successful transactions:        1
Failed transactions:	        0
Longest transaction:	    27560.00 ms
Shortest transaction:	    27560.00 ms
 
POST /v1/audio/speech HTTP/1.0
Host: 0.0.0.0:8880
Accept: */*
Accept-Encoding: gzip, deflate
User-Agent: Mozilla/5.0 (apple-arm-darwin25.4.0) Siege/4.1.7
Connection: close
Content-Type: application/json
Content-Length: 1939

{"article_id":"BHQYE4ALXZEKTD674MBIIKEQ3Y","product":"test","input":"Lindsay Clancy is scheduled to make a court appearance Thursday in her pending case alleging that she strangled her three children to death in her Duxbury home in 2023, records show.  The pretrial hearing for Clancy, 35, is scheduled for 2 p.m. in Plymouth Superior Court, according to legal filings.  Though she has attended several previous hearings remotely from the hospital where she‚Äôs receiving treatment, she‚Äôs being ordered to appear in person Thursday, court documents state.  The former labor and delivery nurse has pleaded not guilty to three counts each of murder and strangulation or suffocation for allegedly killing her children, Cora, 5; Dawson, 3; and Callan, 8 months, with exercise bands on Jan. 24, 2023, after sending her husband, Patrick, to get takeout for the family. Authorities say she cut her wrists and neck after allegedly killing her children and leapt from a second-story window in a failed attempt to end her own life. Clancy is paralyzed from the waist down and remains held at Tewksbury Hospital, where she continues to receive treatment. Her lawyer, Kevin J. Reddington, has said he‚Äôll assert what‚Äôs commonly known as an insanity defense at trial. Should jurors acquit Clancy under that scenario, she would not go free but would instead be sent to a state psychiatric hospital where she‚Äôd come up for periodic reviews to determine whether she can safely live in the community.  Reddington has said Clancy was overmedicated on 13 different drugs as she contended with postpartum issues, a ‚Äúhorrific‚Äù regimen that led to ‚Äúhomicidal ideation, suicidal ideation.‚Äù Clancy‚Äôs trial is scheduled to begin on July 20.  Material from prior Globe stories was used in this report. This story will be updated. ","voice":"af_alloy","speed":1,"return_download_link":true,"lang_code":"a","normalization_options":{"normalize":true}}

#5åÔ'Éà"®`à6V¬¿Å°∞|[Èòò2ò"™ä1

** SIEGE 4.1.7
** Preparing 1 concurrent users for battle.
The server is now under siege...
GET /v1/download/2OJTYW7XNVHJJN7SPNP2IUFPA4.mp3?product=test HTTP/1.0
Host: 0.0.0.0:8880
Accept: */*
Accept-Encoding: gzip, deflate
User-Agent: Mozilla/5.0 (apple-arm-darwin25.4.0) Siege/4.1.7
Connection: close



Transactions:		        1    hits
Availability:		      100.00 %
Elapsed time:		        0.03 secs
Data transferred:	        8.24 MB
Response time:		       30.00 ms
Transaction rate:	       33.33 trans/sec
Throughput:		      274.57 MB/sec
Concurrency:		        1.00
Successful transactions:        1
Failed transactions:	        0
Longest transaction:	       30.00 ms
Shortest transaction:	       30.00 ms
 
ID3